# ---------------------------------------------------------------
# 커피 완성되면 손님에게 알려주기
# ---------------------------------------------------------------

# def makeAmericano():
#     print("에스프레소 샷 추출")
#     # 중간 생략...
#     print("주문하신 아메리카노 나왔습니다!")
#
# def makeCaffeLatte():
#     # ...
#     print("주문하신 카페라떼 나왔습니다!")
#
# makeAmericano()
# makeCaffeLatte()

# ---------------------------------------------------------------
# 함수 결과값을 이용해 손님에게 알려주기
# ---------------------------------------------------------------

# def makeAmericano():
#     print("에스프레소 샷 추출")
#     print("얼음 넣기")
#     print("물 붓기")
#     print("에스프레소 붓기")
#     return "아메리카노"
#
# def makeDripCoffee(bean):
#     print(bean, "원두 투입")
#     print("드리핑")
#
# print("주문하신", makeAmericano(), "나왔습니다!")
# print("주문하신", makeDripCoffee("과테말라"), "나왔습니다!")
# print("주문하신", makeDripCoffee("콜롬비아"), "나왔습니다!")
# print("주문하신", makeDripCoffee("칠레"), "나왔습니다!")

# ---------------------------------------------------------------
