
# ---------------------------------------------------------------
# print를 사용해 아메리카노 추출하기
# ---------------------------------------------------------------

# print("에스프레소 샷 추출")
# print("얼음 넣기")
# print("물 붓기")
# print("에스프레소 붓기")

# ---------------------------------------------------------------
# 아메리카노를 3잔 만드려면?
# ---------------------------------------------------------------

# print("에스프레소 샷 추출")
# print("얼음 넣기")
# print("물 붓기")
# print("에스프레소 붓기")
#
# print("에스프레소 샷 추출")
# print("얼음 넣기")
# print("물 붓기")
# print("에스프레소 붓기")
#
# print("에스프레소 샷 추출")
# print("얼음 넣기")
# print("물 붓기")
# print("에스프레소 붓기")

# ---------------------------------------------------------------
# 함수를 사용해 아메리카노 3잔 추출하기
# ---------------------------------------------------------------

# def makeAmericano():
#     print("에스프레소 샷 추출")
#     print("얼음 넣기")
#     print("물 붓기")
#     print("에스프레소 붓기")
#
# makeAmericano()
# makeAmericano()
# makeAmericano()

